[M_CriticalFail MissionDefinition]
MissionDescription="As thanks for chasing the douchebags out of her tavern, Moxxi has given you one of her guns. You just need to go pick it up."
TurnInDescription="That was easy, wasn't it?"
TeaserText="Here's a freebie for you."

[M_CriticalFail:CriticalFail_FindAgain MissionObjectiveDefinition]
ProgressMessage="Find weapon"

[M_CriticalFail:CriticalFail_FirstFind MissionObjectiveDefinition]
ProgressMessage="Find weapon"

[M_CriticalFail:CriticalFail_KillMonster MissionObjectiveDefinition]
ProgressMessage="Defeat orc"

[M_CriticalFail:CriticalFail_OS_FightMonster MissionObjectiveSetDefinition]
MissionDescriptionOverride="As thanks for chasing the douchebags out of her tavern, Moxxi has given you one of her guns. You just need to go pick it up. Unfortunately, the first time you attempted to pick the gun up ended in tragedy -- you rolled a critical fail, and the gun flew out of your hands. Upon trying a second time, the gun once again flew out of your hands. The third time you tried to grab the gun, it spontaneously turned into a monster with swords for hands. You'd better kill it and grab the damned weapon one last time."

[M_CriticalFail:CriticalFail_OS_FindWeaponAgain MissionObjectiveSetDefinition]
MissionSummaryOverride="Pick up Moxxi's gun one more time."
MissionDescriptionOverride="As thanks for chasing the douchebags out of her tavern, Moxxi has given you one of her guns. You just need to go pick it up. Unfortunately, the first time you attempted to pick the gun up ended in tragedy -- you rolled a critical fail, and the gun flew out of your hands. Upon trying a second time, the gun once again flew out of your hands. You'd better find it one last time."

[M_CriticalFail:CriticalFail_OS_TryToPickup MissionObjectiveSetDefinition]
MissionSummaryOverride="Pick up Moxxi's gun. Again."
MissionDescriptionOverride="As thanks for chasing the douchebags out of her tavern, Moxxi has given you one of her guns. You just need to go pick it up. Unfortunately, the first time you attempted to pick the gun up ended in tragedy -- you rolled a critical fail, and the gun flew out of your hands. You'd better track it down again."

[M_CriticalFail:CriticalFail_PickupWeapon MissionObjectiveDefinition]
ProgressMessage="Find weapon"

[M_CriticalFail:CriticalFail_Roll MissionObjectiveDefinition]
ProgressMessage="Roll to pickup"

[M_CriticalFail:CriticalFail_RollAgain MissionObjectiveDefinition]
ProgressMessage="Roll again"

[M_CriticalFail:CriticalFail_TryToPickup MissionObjectiveDefinition]
ProgressMessage="Pick up weapon"
